src/InformationRegisters/УчастникиСобытийПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>УчастникиСобытийПланировщика</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Участник</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УчастникиСобытия</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОригинальноеСобытие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияПланировщика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Календарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КалендариПланировщика</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Обязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Организатор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Синхронизировать</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Уведомлять</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СобытияПланировщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидУчастника</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчастниковСобытийПланировщика</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыУчастниковСобытийПланировщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Enum>
		<Properties>
			<Name>ВидыУчастниковСобытийПланировщика</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Организатор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчастникСсылка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УчастникСтрока</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/УчастникиСобытийПланировщика/Ext/ManagerModule.bsl
Функция ПолучитьВидыУчастников() Экспорт

	Соответствие = Новый Соответствие;
	Соответствие.Вставить(1, "Пользователь (участник)");
	Соответствие.Вставить(2, "Контактное лицо (участник)");
	Соответствие.Вставить(3, "Прочее (представление)");
	
	Возврат Соответствие;
	
КонецФункции

Процедура ВыполнитьЗапись(Отказ, СобытиеСсылка, ТаблицаДанных) Экспорт
	
	Попытка
		// Блокируем данные для записи
		Блокировка = Новый БлокировкаДанных;
		
		Элемент = Блокировка.Добавить("РегистрСведений.УчастникиСобытийПланировщика");
		Элемент.Режим = РежимБлокировкиДанных.Исключительный;
		Элемент.УстановитьЗначение("Событие", СобытиеСсылка);
		
		Блокировка.Заблокировать();
		
		// Считываем записи и заполняем их вновь
		НаборЗаписей = РегистрыСведений.УчастникиСобытийПланировщика.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Событие.Установить(СобытиеСсылка);
		НаборЗаписей.Прочитать();
		
		// Проверяем существующие записи
		Проверенные	= Новый Массив;
		Удаление	= Новый Массив;
		
		Для Каждого ЗаписьРегистра Из НаборЗаписей Цикл
			МассивСтрок = ТаблицаДанных.НайтиСтроки(Новый Структура("Идентификатор", ЗаписьРегистра.Идентификатор));
			Если МассивСтрок.Количество() = 0 Тогда
				Удаление.Добавить(ЗаписьРегистра);
			Иначе 
				ЗаполнитьЗначенияСвойств(ЗаписьРегистра, МассивСтрок[0]);
				Проверенные.Добавить(МассивСтрок[0]);
			КонецЕсли;
		КонецЦикла;
		
		// Удаляем старые строки
		Для Каждого ЗаписьРегистра Из Удаление Цикл
			НаборЗаписей.Удалить(ЗаписьРегистра);
		КонецЦикла;
		
		// Добавляем новые строки
		Для Каждого СтрокаТаблицы Из ТаблицаДанных Цикл
			Если НЕ Проверенные.Найти(СтрокаТаблицы) = Неопределено Тогда
				Продолжить;
			КонецЕсли;
			
			ЗаписьРегистра = НаборЗаписей.Добавить();
			ЗаписьРегистра.Событие = СобытиеСсылка;
			ЗаполнитьЗначенияСвойств(ЗаписьРегистра, СтрокаТаблицы);
			
			Если ЗаписьРегистра.Идентификатор = ПланировщикКлиентСервер.ПустойИдентификатор() Тогда
				ЗаписьРегистра.Идентификатор = Новый УникальныйИдентификатор;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(ЗаписьРегистра.ВидУчастника) Тогда
				Если ЗначениеЗаполнено(ЗаписьРегистра.Участник) Тогда
					ЗаписьРегистра.ВидУчастника = Перечисления.ВидыУчастниковСобытийПланировщика.УчастникСсылка;
				Иначе 
					ЗаписьРегистра.ВидУчастника = Перечисления.ВидыУчастниковСобытийПланировщика.УчастникСтрока;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		// Записываем набор
		НаборЗаписей.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры
